Revit 2027 API
RenderingSettings.ResolutionTarget Property
 The resolution target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ResolutionTarget ResolutionTarget { get; set; }
Public Property ResolutionTarget As ResolutionTarget
	Get
	Set
public:
property ResolutionTarget ResolutionTarget {
	ResolutionTarget get ();
	void set (ResolutionTarget value);
}
member ResolutionTarget : ResolutionTarget with get, set
Property Value
ResolutionTarget
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RenderingSettings Class
Autodesk.Revit.DB Namespace